<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<%
	String path = request.getContextPath();
	String basePath = request.getScheme() + "://" + request.getLocalAddr() + ":" + request.getServerPort()
			+ path + "/";
%>
<!DOCTYPE html>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
		<meta charset="UTF-8">
<title>王者之师隐私声明</title>
<meta name="viewport"
	content="width=device-width, initial-scale=1.0, user-scalable=0">
<meta name="apple-mobile-web-app-capable" content="yes">
<meta name="apple-mobile-web-app-status-bar-style" content="black">
<meta name="format-detection" content="telephone=no">
<style> 
.divcss5{color:#ffffff} 
</style>
</head>

<body style="padding: 0;">	
	<div class="divcss5">
		<center><h2>《王者之师》隐私声明</h2></center>
		<div>
			
			<h3><b>1.我们收集的信息</b></h3>
			&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;在您使用《王者之师》游戏服务的过程中，《王者之师》游戏会按照如下方式收集您在使用服务时主动提供的或因为使用服务而产生的信息，用以向您提供、优化我们的服务以及保障您的账户安全：<br /><br />
          
          <b>1.1</b> 当您注册或使用《王者之师》游戏服务时，我们会收集您的网络身份标识信息及个人常用设备信息，用于标记您为《王者之师》游戏的用户。<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;为了更好地向您提供游戏服务，改善游戏体验，我们可对您在《王者之师》游戏中的相关操作信息、游戏信息等信息（以下称“游戏信息”。游戏信息具体包括但不限于您的登录状态、对战信息/状态等）进行使用。我们可能会视游戏产品具体情况为您提供相关权限，以便您可以对是否展示前述相关信息进行相应设置。<br />
          <br />
			<b>1.2</b> 为满足相关法律法规政策及相关主管部门的要求，我们会在获得您同意或您主动提供的情况下收集您的游戏信息，在注册帐号的同时，如果拒绝接受用户协议会导致您无法登陆《王者之师》游戏。<br />
          <br />
			<b>1.3</b> 为保障您正常使用我们的服务，维护游戏基础功能的正常运行，优化游戏产品性能，提升您的游戏体验并保障您的账号安全，我们会收集您的设备ID、设备名称、设备类型和版本、系统版本、IP地址、MAC地址、应用ID、网络类型等信息。<br />
          <br />
        <b>1.4</b> 当您使用《王者之师》游戏服务时，我们会收集您的游戏日志信息，例如登录日志、物品日志、游戏对局信息等，同时用于游戏运营统计分析、客服投诉处理及其他游戏安全分析，并为提升您的游戏体验。<br />
			<br />
        <b>1.5</b> 如您使用小米、魅族、华为等品牌手机，《王者之师》游戏接入的上述手机厂商Push SDK需要收集手机唯一标识信息（例如IMEI），并可能会收集您的手机型号、系统类型、系统版本、设备屏幕尺寸等参数用于实现《王者之师》游戏产品和活动等信息的推送，具体情况请参见SDK运营方的隐私声明或相关声明。<br />
			<br />
        <b>1.6</b> 当您使用《王者之师》游戏产品的消费功能时，我们会收集您的充值记录、消费记录等信息，以便您查询您的交易记录，同时尽最大程度保护您的虚拟物品安全。充值记录、消费记录属于敏感信息，收集上述信息为实现《王者之师》游戏产品的消费功能所必须，否则将无法完成交易。<br />
			<br />
        <b>1.7</b> 为保障您的游戏账号安全，营造公平、健康及安全的游戏环境，我们会收集您的游戏识别信息、硬件及操作系统信息、进程及游戏崩溃记录等信息，以用于打击破坏游戏公平环境或干扰、破坏游戏服务正常进行的行为（如用于检测盗版、扫描外挂、防止作弊等）。<br />
        <br />
        <b>1.8</b> 当您在游戏中通过文字、图片、语音、视频及其他方式与其他玩家进行互动，我们可能会收集并保存您发送的上述信息内容用于过滤色情、暴力、政治、辱骂、恶意广告等不当内容，以此净化游戏环境，维护健康的上网环境。<br />
        <br />
        <b>1.9</b> 根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意：<br /> 
        <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.1</b> 与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；</i><br />  
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.2</b> 与犯罪侦查、起诉、审判和判决执行等直接相关的；</i><br />    
			<br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.3</b> 出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；</i><br />  
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.4</b> 所收集的个人信息是您自行向社会公众公开的；</i><br />    
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.5</b> 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</i><br />    
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.6</b> 根据您要求签订和履行合同所必需的；</i><br />  
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.7</b> 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</i><br />    
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.8</b> 为开展合法的新闻报道所必需的；</i><br />    
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.9</b> 出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</i><br />  
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>1.9.10</b> 法律法规规定的其他情形。</i><br />    
        <br />

        <b>1.10</b> 请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。<br />    
        <br />  
        <h3><b>2.信息的存储</b></h3>  
			<h4>2.1 信息存储的方式和期限<br /></h4>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们会通过安全的方式存储您的信息，包括本地存储（例如利用APP进行数据缓存）、数据库和服务器日志。<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。
<br />   
        <h4>2.2 信息存储的地域<br /></h4>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。<br /> 
        <h4>2.3 产品或服务停止运营时的通知<br /></h4>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;当我们的产品或服务发生停止运营的情况时，我们将根据相关法律法规规定进行公告通知，并依法保障您的合法权益。<br />
          
         <h3><b>3.信息安全</b></h3>  
         &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。<br /> 
        <h4>3.1 安全保护措施<br /></h4>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们努力为用户的信息安全提供保障，以防止信息的泄露、丢失、不当使用、未经授权访问和披露等。我们使用多方位的安全保护措施，以确保用户的个人信息保护处于合理的安全水平，包括技术保护手段、管理制度控制、安全体系保障等诸多方面。此外，我们游戏的相关系统还通过了国家网络安全等级保护（二级）的备案和测评。<br />
          
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们采用业界领先的技术保护措施。我们使用的技术手段包括但不限于防火墙、加密（例如SSL）、去标识化或匿名化处理、访问控制措施等。此外，我们还会不断加强安装在您设备端的软件的安全能力。例如，我们会在您的设备本地完成部分信息加密工作，以巩固安全传输；我们会了解您设备安装的应用信息和运行的进程信息，以预防病毒、木马等恶意程序。<br />
          
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们建立了保障个人信息安全专门的管理制度、流程和组织。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务并进行审计，违反义务的人员会根据规定进行处罚。我们也会审查该管理制度、流程和组织，以防未经授权的人员擅自访问、使用或披露用户的信息。<br />
          
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们建议您在使用产品和服务时充分注意对个人信息的保护，我们也会提供多种安全功能来协助您保护自己的个人信息安全。

<br />   
        <h4>3.2 安全事件处置措施<br /></h4>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;若发生个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大。安全事件发生后，我们会以公告、推送通知或邮件等形式告知您安全事件的基本情况、我们即将或已经采取的处置措施和补救措施，以及我们对您的应对建议。如果难以实现逐一告知，我们将通过公告等方式发布警示。<br /> 
          
         <h3><b>4.我们如何使用信息</b></h3>  
         &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们严格遵守法律法规的规定以及与用户的约定，按照本指引及《《王者之师》用户协议》、《《王者之师》隐私声明》所述使用收集的信息，以向您提供更为优质的服务。<br /> 
        <h4>4.1 信息使用规则<br /></h4>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们会按照如下规则使用收集的信息：<br /> 
        <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>4.1.1</b> 我们会根据我们收集的信息向您提供各项功能与服务，包括基础游戏功能、玩家互动功能、消费功能等；</i><br />  
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>4.1.2</b> 我们会根据您的游戏等级、偏好、习惯、消费等特征为您提供个性化服务，包括基于特征标签进行间接人群画像并向您推荐您可能感兴趣的活动、比赛、促销等推广内容。</i><br />    
			<br />
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i><b>4.1.3</b> 我们会根据您使用《王者之师》游戏产品的频率和情况、故障信息、性能信息等分析我们产品的运行情况，以确保服务的安全性，并优化我们的产品，提高我们的服务质量。我们不会将我们存储在分析软件中的信息与您提供的个人身份信息相结合。</i><br />  
          
        <h4>4.2 定向推送活动的规则<br /></h4>
         &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们会根据您的游戏等级、偏好、习惯、消费等特征为您提供个性化的推广内容，例如向您推荐您可能喜欢的游戏皮肤。我们可能会视游戏产品具体情况为您提供相关权限，以便您可以通过相关设置降低推荐内容与您的相关性/退出此类个性化推送。<br />   
        <h4>4.3 告知变动目的后征得同意的方式<br /></h4>
         &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们将会在本指引所涵盖的用途内使用收集的信息。如我们使用您的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用您的个人信息前，再次向您告知并征得您的明示同意。<br />
          
         <h3><b>5.对外提供</b></h3>  
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;目前，除本指引以及《《王者之师》用户协议》规定的情形之外，我们不会主动共享、提供或转让您的个人信息至《王者之师》集团外的第三方，如存在其他共享、提供或转让您的个人信息或您需要我们将您的个人信息共享、提供或转让至《王者之师》集团外的第三方情形时，我们会直接或确认该第三方征得您对上述行为的明示同意。<br /> 
          
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;除本指引以及《《王者之师》用户协议》、《《王者之师》隐私声明》另有规定外，我们不会对外公开披露所收集的个人信息。如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。<br />  

         &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将告知您相关情形，按照法律法规及不低于本指引所要求的标准继续保护或要求新的控制者继续保护您的个人信息。<br /> 

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得您的授权同意：<br />   
          <br /> 
         <b>5.1</b> 与国家安全、国防安全直接相关的；<br /> <br />
         <b>5.2</b> 与公共安全、公共卫生、重大公共利益直接相关的；<br /> <br />
         <b>5.3</b> 与犯罪侦查、起诉、审判和判决执行等直接相关的；<br />  <br />
         <b>5.4</b> 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br /> <br />
         <b>5.5</b> 个人信息主体自行向社会公众公开个人信息的；<br />  <br />
         <b>5.6</b> 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。<br /> 
        <h3><b>6.您的权利</b></h3>     
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;在您使用《王者之师》游戏服务期间，我们可能会视游戏产品具体情况为您提供相应的操作设置，以便您可以查询、删除、更正或撤回您的相关个人信息，您可参考相应游戏产品的具体指引进行操作。此外，我们还设置了问题反馈渠道，您的意见将会得到及时的处理。<br />  
        <h3><b>7.变更</b></h3>     
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;我们可能会适时对本指引进行修订。当本指引的条款发生变更时，我们会在版本更新时以适当的方式向您提示变更后的指引。请您仔细阅读变更后的隐私保护指引或指引内容，您继续使用《王者之师》游戏表示您同意我们按照更新后的隐私保护指引收集、处理或使用您的个人信息。<br />  
        <h3><b>8.其他</b></h3>     
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;《《王者之师》隐私声明》是统一适用的一般性隐私条款，其中所规定的内容包括但不限于用户权利及信息安全保障措施等均适用于《王者之师》游戏用户。如《《王者之师》隐私声明》与本指引存在不一致或矛盾之处，请以本指引为准。<br />  <br /> 
          
		</div>
		
		<p>
			<a href="uniwebview://close"><input type="button" value="同意 "
				class="btn-pay"></a>
		</p>
	</div>

</body>
</html>